In [1]:
import pandas as pd

In [20]:
data = {
    "Name":['Ram','Hari','Krishna','Sita','Gita','Ram','Krishna'],
    "Nepali":[40,45,47,48,44,40,46],
    "English":[45,48,43,45,49,45,43],
    "Data":['4+',45,65,'3+',36,'4+',55]
}
# Ram's data is duplicate, for duplicate all the values in row should be duplicate

In [21]:
dataset = pd.DataFrame(data)
dataset

      Name  Nepali  English Data
0      Ram      40       45   4+
1     Hari      45       48   45
2  Krishna      47       43   65
3     Sita      48       45   3+
4     Gita      44       49   36
5      Ram      40       45   4+
6  Krishna      46       43   55

In [22]:
dataset.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [23]:
dataset.drop_duplicates(inplace=True)

In [24]:
dataset

      Name  Nepali  English Data
0      Ram      40       45   4+
1     Hari      45       48   45
2  Krishna      47       43   65
3     Sita      48       45   3+
4     Gita      44       49   36
6  Krishna      46       43   55

In [28]:
# First fill the null value then replace other 
dataset["Data"].replace("4+","46",inplace=True)

C:\Users\ashvi\AppData\Local\Temp\ipykernel_25092\4111821573.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Data"].replace("4+","46",inplace=True)

In [29]:
dataset

      Name  Nepali  English Data
0      Ram      40       45   46
1     Hari      45       48   45
2  Krishna      47       43   65
3     Sita      48       45    3
4     Gita      44       49   36
6  Krishna      46       43   55

In [33]:
dataset["Data"]=dataset["Data"].astype("int64")

In [34]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Nepali   6 non-null      int64
 2   English  6 non-null      int64
 3   Data     6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 240.0+ bytes

In [35]:
dataset

      Name  Nepali  English  Data
0      Ram      40       45    46
1     Hari      45       48    45
2  Krishna      47       43    65
3     Sita      48       45     3
4     Gita      44       49    36
6  Krishna      46       43    55